In [1]:
# Concat -----we should have common column

In [2]:
# Merge

In [3]:
import pandas as pd

In [5]:
df1 = pd.DataFrame(
                    {'city':['pune','banglore','mumbai'],
                     'avg_pop':[23,66,788]
                    }
)

In [6]:
df1

       city  avg_pop
0      pune       23
1  banglore       66
2    mumbai      788

In [7]:
df2 = pd.DataFrame(
                    {'city':['ratnagiri','nagpur','thane'],
                     'avg_pop':[45,78,96],
                     'temp':[35,45,40]
                    }
)

In [8]:
df2

        city  avg_pop  temp
0  ratnagiri       45    35
1     nagpur       78    45
2      thane       96    40

In [9]:
pd.concat([df1,df2])

        city  avg_pop  temp
0       pune       23   NaN
1   banglore       66   NaN
2     mumbai      788   NaN
0  ratnagiri       45  35.0
1     nagpur       78  45.0
2      thane       96  40.0

In [10]:
df3 = pd.concat([df1,df2])

In [11]:
df3

        city  avg_pop  temp
0       pune       23   NaN
1   banglore       66   NaN
2     mumbai      788   NaN
0  ratnagiri       45  35.0
1     nagpur       78  45.0
2      thane       96  40.0

In [12]:
# we want to convert data into csv or exel

In [13]:
df3.to_csv('C:\\Users\\rohan\\EDA_Practice\\df3.csv')

In [15]:
df3.to_excel('C:\\Users\\rohan\\EDA_Practice\\df3.xlsx')

In [18]:
df3['State']= 'MH'   # add state column in dataframe which value mh is put in all row

In [19]:
df3

        city  avg_pop  temp State
0       pune       23   NaN    MH
1   banglore       66   NaN    MH
2     mumbai      788   NaN    MH
0  ratnagiri       45  35.0    MH
1     nagpur       78  45.0    MH
2      thane       96  40.0    MH

In [27]:
df5 = pd.merge(df1,df2,on = 'city')  # by defaults inner join perferd so no data inserted

In [28]:
df5

Empty DataFrame
Columns: [city, avg_pop_x, avg_pop_y, temp]
Index: []

In [29]:
df6 = pd.merge(df1,df2,on='city',how='outer',suffixes=('__left','__right'),indicator=True)

In [30]:
df6

        city  avg_pop__left  avg_pop__right  temp      _merge
0       pune           23.0             NaN   NaN   left_only
1   banglore           66.0             NaN   NaN   left_only
2     mumbai          788.0             NaN   NaN   left_only
3  ratnagiri            NaN            45.0  35.0  right_only
4     nagpur            NaN            78.0  45.0  right_only
5      thane            NaN            96.0  40.0  right_only